---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
source: html/c063b8fa-9c23-b006-054c-f60b721cdc0e.htm
---
# RebarShapeConstraint180DegreeBendArcLength Properties

Specifies whether the .NET object represents a valid Revit entity.